espressif/esp-idf/components/soc/esp32p4/include/soc/gdma_struct.h
/** Type of ch1_dar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_dar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_dar0:32;
    };
    uint32_t val;
} dmac_ch1_dar0_reg_t;

/** Type of ch1_dar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_dar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_dar1:32;
    };
    uint32_t val;
} dmac_ch1_dar1_reg_t;

/** Type of ch1_block_ts0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_block_ts : R/W; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch1_block_ts:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch1_block_ts0_reg_t;

/** Type of ch1_ctl0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_sms:1;
        uint32_t reserved_1:1;
        /** ch1_dms : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch1_dms:1;
        uint32_t reserved_3:1;
        /** ch1_sinc : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch1_sinc:1;
        uint32_t reserved_5:1;
        /** ch1_dinc : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch1_dinc:1;
        uint32_t reserved_7:1;
        /** ch1_src_tr_width : R/W; bitpos: [10:8]; default: 2;
         *  NA
         */
        uint32_t ch1_src_tr_width:3;
        /** ch1_dst_tr_width : R/W; bitpos: [13:11]; default: 2;
         *  NA
         */
        uint32_t ch1_dst_tr_width:3;
        /** ch1_src_msize : R/W; bitpos: [17:14]; default: 0;
         *  NA
         */
        uint32_t ch1_src_msize:4;
        /** ch1_dst_msize : R/W; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_msize:4;
        /** ch1_ar_cache : R/W; bitpos: [25:22]; default: 0;
         *  NA
         */
        uint32_t ch1_ar_cache:4;
        /** ch1_aw_cache : R/W; bitpos: [29:26]; default: 0;
         *  NA
         */
        uint32_t ch1_aw_cache:4;
        /** ch1_nonposted_lastwrite_en : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch1_nonposted_lastwrite_en:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} dmac_ch1_ctl0_reg_t;

/** Type of ch1_ctl1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_ar_prot : R/W; bitpos: [2:0]; default: 0;
         *  NA
         */
        uint32_t ch1_ar_prot:3;
        /** ch1_aw_prot : R/W; bitpos: [5:3]; default: 0;
         *  NA
         */
        uint32_t ch1_aw_prot:3;
        /** ch1_arlen_en : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch1_arlen_en:1;
        /** ch1_arlen : R/W; bitpos: [14:7]; default: 0;
         *  NA
         */
        uint32_t ch1_arlen:8;
        /** ch1_awlen_en : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t ch1_awlen_en:1;
        /** ch1_awlen : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t ch1_awlen:8;
        /** ch1_src_stat_en : R/W; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t ch1_src_stat_en:1;
        /** ch1_dst_stat_en : R/W; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_stat_en:1;
        /** ch1_ioc_blktfr : R/W; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t ch1_ioc_blktfr:1;
        uint32_t reserved_27:3;
        /** ch1_shadowreg_or_lli_last : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch1_shadowreg_or_lli_last:1;
        /** ch1_shadowreg_or_lli_valid : R/W; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch1_shadowreg_or_lli_valid:1;
    };
    uint32_t val;
} dmac_ch1_ctl1_reg_t;

/** Type of ch1_cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_src_multblk_type : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t ch1_src_multblk_type:2;
        /** ch1_dst_multblk_type : R/W; bitpos: [3:2]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_multblk_type:2;
        uint32_t reserved_4:14;
        /** ch1_rd_uid : RO; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t ch1_rd_uid:4;
        uint32_t reserved_22:3;
        /** ch1_wr_uid : RO; bitpos: [28:25]; default: 0;
         *  NA
         */
        uint32_t ch1_wr_uid:4;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dmac_ch1_cfg0_reg_t;

/** Type of ch1_cfg1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_tt_fc : R/W; bitpos: [2:0]; default: 3;
         *  NA
         */
        uint32_t ch1_tt_fc:3;
        /** ch1_hs_sel_src : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch1_hs_sel_src:1;
        /** ch1_hs_sel_dst : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch1_hs_sel_dst:1;
        /** ch1_src_hwhs_pol : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch1_src_hwhs_pol:1;
        /** ch1_dst_hwhs_pol : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_hwhs_pol:1;
        /** ch1_src_per : R/W; bitpos: [8:7]; default: 0;
         *  NA
         */
        uint32_t ch1_src_per:2;
        uint32_t reserved_9:3;
        /** ch1_dst_per : R/W; bitpos: [13:12]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_per:2;
        uint32_t reserved_14:3;
        /** ch1_ch_prior : R/W; bitpos: [19:17]; default: 3;
         *  NA
         */
        uint32_t ch1_ch_prior:3;
        /** ch1_lock_ch : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t ch1_lock_ch:1;
        /** ch1_lock_ch_l : RO; bitpos: [22:21]; default: 0;
         *  NA
         */
        uint32_t ch1_lock_ch_l:2;
        /** ch1_src_osr_lmt : R/W; bitpos: [26:23]; default: 0;
         *  NA
         */
        uint32_t ch1_src_osr_lmt:4;
        /** ch1_dst_osr_lmt : R/W; bitpos: [30:27]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_osr_lmt:4;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} dmac_ch1_cfg1_reg_t;

/** Type of ch1_llp0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_lms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_lms:1;
        uint32_t reserved_1:5;
        /** ch1_loc0 : R/W; bitpos: [31:6]; default: 0;
         *  NA
         */
        uint32_t ch1_loc0:26;
    };
    uint32_t val;
} dmac_ch1_llp0_reg_t;

