espressif/esp-idf/components/soc/esp32p4/include/soc/gdma_struct.h
/** Type of ch2_swhsdst0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_swhs_req_dst : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_req_dst:1;
        /** ch2_swhs_req_dst_we : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_req_dst_we:1;
        /** ch2_swhs_sglreq_dst : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_sglreq_dst:1;
        /** ch2_swhs_sglreq_dst_we : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_sglreq_dst_we:1;
        /** ch2_swhs_lst_dst : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_lst_dst:1;
        /** ch2_swhs_lst_dst_we : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch2_swhs_lst_dst_we:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dmac_ch2_swhsdst0_reg_t;

/** Type of ch2_blk_tfr_resumereq0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_blk_tfr_resumereq : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch2_blk_tfr_resumereq:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dmac_ch2_blk_tfr_resumereq0_reg_t;

/** Type of ch2_axi_id0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_axi_read_id_suffix : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch2_axi_read_id_suffix:1;
        uint32_t reserved_1:15;
        /** ch2_axi_write_id_suffix : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch2_axi_write_id_suffix:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dmac_ch2_axi_id0_reg_t;

/** Type of ch2_axi_qos0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_axi_awqos : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t ch2_axi_awqos:4;
        /** ch2_axi_arqos : R/W; bitpos: [7:4]; default: 0;
         *  NA
         */
        uint32_t ch2_axi_arqos:4;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} dmac_ch2_axi_qos0_reg_t;

/** Type of ch3_sar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_sar0:32;
    };
    uint32_t val;
} dmac_ch3_sar0_reg_t;

/** Type of ch3_sar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_sar1:32;
    };
    uint32_t val;
} dmac_ch3_sar1_reg_t;

/** Type of ch3_dar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_dar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_dar0:32;
    };
    uint32_t val;
} dmac_ch3_dar0_reg_t;

/** Type of ch3_dar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_dar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_dar1:32;
    };
    uint32_t val;
} dmac_ch3_dar1_reg_t;

/** Type of ch3_block_ts0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_block_ts : R/W; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch3_block_ts:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch3_block_ts0_reg_t;

/** Type of ch3_ctl0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch3_sms:1;
        uint32_t reserved_1:1;
        /** ch3_dms : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_dms:1;
        uint32_t reserved_3:1;
        /** ch3_sinc : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch3_sinc:1;
        uint32_t reserved_5:1;
        /** ch3_dinc : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch3_dinc:1;
        uint32_t reserved_7:1;
        /** ch3_src_tr_width : R/W; bitpos: [10:8]; default: 2;
         *  NA
         */
        uint32_t ch3_src_tr_width:3;
        /** ch3_dst_tr_width : R/W; bitpos: [13:11]; default: 2;
         *  NA
         */
        uint32_t ch3_dst_tr_width:3;
        /** ch3_src_msize : R/W; bitpos: [17:14]; default: 0;
         *  NA
         */
        uint32_t ch3_src_msize:4;
        /** ch3_dst_msize : R/W; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_msize:4;
        /** ch3_ar_cache : R/W; bitpos: [25:22]; default: 0;
         *  NA
         */
        uint32_t ch3_ar_cache:4;
        /** ch3_aw_cache : R/W; bitpos: [29:26]; default: 0;
         *  NA
         */
        uint32_t ch3_aw_cache:4;
        /** ch3_nonposted_lastwrite_en : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch3_nonposted_lastwrite_en:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} dmac_ch3_ctl0_reg_t;

/** Type of ch3_ctl1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_ar_prot : R/W; bitpos: [2:0]; default: 0;
         *  NA
         */
        uint32_t ch3_ar_prot:3;
        /** ch3_aw_prot : R/W; bitpos: [5:3]; default: 0;
         *  NA
         */
        uint32_t ch3_aw_prot:3;
        /** ch3_arlen_en : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch3_arlen_en:1;
        /** ch3_arlen : R/W; bitpos: [14:7]; default: 0;
         *  NA
         */
        uint32_t ch3_arlen:8;
        /** ch3_awlen_en : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t ch3_awlen_en:1;
        /** ch3_awlen : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t ch3_awlen:8;
        /** ch3_src_stat_en : R/W; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t ch3_src_stat_en:1;
        /** ch3_dst_stat_en : R/W; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_stat_en:1;
        /** ch3_ioc_blktfr : R/W; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t ch3_ioc_blktfr:1;
        uint32_t reserved_27:3;
        /** ch3_shadowreg_or_lli_last : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch3_shadowreg_or_lli_last:1;
        /** ch3_shadowreg_or_lli_valid : R/W; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch3_shadowreg_or_lli_valid:1;
    };
    uint32_t val;
} dmac_ch3_ctl1_reg_t;

/** Type of ch3_cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_src_multblk_type : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t ch3_src_multblk_type:2;
        /** ch3_dst_multblk_type : R/W; bitpos: [3:2]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_multblk_type:2;
        uint32_t reserved_4:14;
        /** ch3_rd_uid : RO; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t ch3_rd_uid:4;
        uint32_t reserved_22:3;
        /** ch3_wr_uid : RO; bitpos: [28:25]; default: 0;
         *  NA
         */
        uint32_t ch3_wr_uid:4;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dmac_ch3_cfg0_reg_t;

/** Type of ch3_cfg1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_tt_fc : R/W; bitpos: [2:0]; default: 3;
         *  NA
         */
        uint32_t ch3_tt_fc:3;
        /** ch3_hs_sel_src : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch3_hs_sel_src:1;
        /** ch3_hs_sel_dst : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch3_hs_sel_dst:1;
        /** ch3_src_hwhs_pol : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch3_src_hwhs_pol:1;
        /** ch3_dst_hwhs_pol : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_hwhs_pol:1;
        /** ch3_src_per : R/W; bitpos: [8:7]; default: 0;
         *  NA
         */
        uint32_t ch3_src_per:2;
        uint32_t reserved_9:3;
        /** ch3_dst_per : R/W; bitpos: [13:12]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_per:2;
        uint32_t reserved_14:3;
        /** ch3_ch_prior : R/W; bitpos: [19:17]; default: 1;
         *  NA
         */
        uint32_t ch3_ch_prior:3;
        /** ch3_lock_ch : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t ch3_lock_ch:1;
        /** ch3_lock_ch_l : RO; bitpos: [22:21]; default: 0;
         *  NA
         */
        uint32_t ch3_lock_ch_l:2;
        /** ch3_src_osr_lmt : R/W; bitpos: [26:23]; default: 0;
         *  NA
         */
        uint32_t ch3_src_osr_lmt:4;
        /** ch3_dst_osr_lmt : R/W; bitpos: [30:27]; default: 0;
         *  NA
         */
        uint32_t ch3_dst_osr_lmt:4;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} dmac_ch3_cfg1_reg_t;

/** Type of ch3_llp0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_lms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch3_lms:1;
        uint32_t reserved_1:5;
        /** ch3_loc0 : R/W; bitpos: [31:6]; default: 0;
         *  NA
         */
        uint32_t ch3_loc0:26;
    };
    uint32_t val;
} dmac_ch3_llp0_reg_t;

/** Type of ch3_llp1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_loc1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_loc1:32;
    };
    uint32_t val;
} dmac_ch3_llp1_reg_t;

/** Type of ch3_swhssrc0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_swhs_req_src : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_req_src:1;
        /** ch3_swhs_req_src_we : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_req_src_we:1;
        /** ch3_swhs_sglreq_src : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_sglreq_src:1;
        /** ch3_swhs_sglreq_src_we : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_sglreq_src_we:1;
        /** ch3_swhs_lst_src : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_lst_src:1;
        /** ch3_swhs_lst_src_we : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch3_swhs_lst_src_we:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dmac_ch3_swhssrc0_reg_t;

