espressif/esp-idf/components/soc/esp32p4/include/soc/gdma_struct.h
/** Type of commonreg_intstatus0 register
 *  NA
 */
typedef union {
    struct {
        /** slvif_commonreg_dec_err_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t slvif_commonreg_dec_err_intstat:1;
        /** slvif_commonreg_wr2ro_err_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t slvif_commonreg_wr2ro_err_intstat:1;
        /** slvif_commonreg_rd2wo_err_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t slvif_commonreg_rd2wo_err_intstat:1;
        /** slvif_commonreg_wronhold_err_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t slvif_commonreg_wronhold_err_intstat:1;
        uint32_t reserved_4:3;
        /** slvif_commonreg_wrparity_err_intstat : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t slvif_commonreg_wrparity_err_intstat:1;
        /** slvif_undefinedreg_dec_err_intstat : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t slvif_undefinedreg_dec_err_intstat:1;
        /** mxif1_rch0_eccprot_correrr_intstat : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mxif1_rch0_eccprot_correrr_intstat:1;
        /** mxif1_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mxif1_rch0_eccprot_uncorrerr_intstat:1;
        /** mxif1_rch1_eccprot_correrr_intstat : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mxif1_rch1_eccprot_correrr_intstat:1;
        /** mxif1_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mxif1_rch1_eccprot_uncorrerr_intstat:1;
        /** mxif1_bch_eccprot_correrr_intstat : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t mxif1_bch_eccprot_correrr_intstat:1;
        /** mxif1_bch_eccprot_uncorrerr_intstat : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t mxif1_bch_eccprot_uncorrerr_intstat:1;
        /** mxif2_rch0_eccprot_correrr_intstat : RO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t mxif2_rch0_eccprot_correrr_intstat:1;
        /** mxif2_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t mxif2_rch0_eccprot_uncorrerr_intstat:1;
        /** mxif2_rch1_eccprot_correrr_intstat : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t mxif2_rch1_eccprot_correrr_intstat:1;
        /** mxif2_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t mxif2_rch1_eccprot_uncorrerr_intstat:1;
        /** mxif2_bch_eccprot_correrr_intstat : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t mxif2_bch_eccprot_correrr_intstat:1;
        /** mxif2_bch_eccprot_uncorrerr_intstat : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t mxif2_bch_eccprot_uncorrerr_intstat:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dmac_commonreg_intstatus0_reg_t;

/** Type of ch1_intstatus_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_enable_block_tfr_done_intstat : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_block_tfr_done_intstat:1;
        /** ch1_enable_dma_tfr_done_intstat : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dma_tfr_done_intstat:1;
        uint32_t reserved_2:1;
        /** ch1_enable_src_transcomp_intstat : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_transcomp_intstat:1;
        /** ch1_enable_dst_transcomp_intstat : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_transcomp_intstat:1;
        /** ch1_enable_src_dec_err_intstat : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_dec_err_intstat:1;
        /** ch1_enable_dst_dec_err_intstat : R/W; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_dec_err_intstat:1;
        /** ch1_enable_src_slv_err_intstat : R/W; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_slv_err_intstat:1;
        /** ch1_enable_dst_slv_err_intstat : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_slv_err_intstat:1;
        /** ch1_enable_lli_rd_dec_err_intstat : R/W; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_rd_dec_err_intstat:1;
        /** ch1_enable_lli_wr_dec_err_intstat : R/W; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_wr_dec_err_intstat:1;
        /** ch1_enable_lli_rd_slv_err_intstat : R/W; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_rd_slv_err_intstat:1;
        /** ch1_enable_lli_wr_slv_err_intstat : R/W; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_wr_slv_err_intstat:1;
        /** ch1_enable_shadowreg_or_lli_invalid_err_intstat : R/W; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_shadowreg_or_lli_invalid_err_intstat:1;
        /** ch1_enable_slvif_multiblktype_err_intstat : R/W; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_multiblktype_err_intstat:1;
        uint32_t reserved_15:1;
        /** ch1_enable_slvif_dec_err_intstat : R/W; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_dec_err_intstat:1;
        /** ch1_enable_slvif_wr2ro_err_intstat : R/W; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wr2ro_err_intstat:1;
        /** ch1_enable_slvif_rd2rwo_err_intstat : R/W; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_rd2rwo_err_intstat:1;
        /** ch1_enable_slvif_wronchen_err_intstat : R/W; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wronchen_err_intstat:1;
        /** ch1_enable_slvif_shadowreg_wron_valid_err_intstat : R/W; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_shadowreg_wron_valid_err_intstat:1;
        /** ch1_enable_slvif_wronhold_err_intstat : R/W; bitpos: [21]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wronhold_err_intstat:1;
        uint32_t reserved_22:3;
        /** ch1_enable_slvif_wrparity_err_intstat : RO; bitpos: [25]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wrparity_err_intstat:1;
        uint32_t reserved_26:1;
        /** ch1_enable_ch_lock_cleared_intstat : R/W; bitpos: [27]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_lock_cleared_intstat:1;
        /** ch1_enable_ch_src_suspended_intstat : R/W; bitpos: [28]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_src_suspended_intstat:1;
        /** ch1_enable_ch_suspended_intstat : R/W; bitpos: [29]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_suspended_intstat:1;
        /** ch1_enable_ch_disabled_intstat : R/W; bitpos: [30]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_disabled_intstat:1;
        /** ch1_enable_ch_aborted_intstat : R/W; bitpos: [31]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_aborted_intstat:1;
    };
    uint32_t val;
} dmac_ch1_intstatus_enable0_reg_t;

/** Type of ch1_intstatus_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_enable_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_chmem_correrr_intstat:1;
        /** ch1_enable_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch1_enable_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_uidmem_correrr_intstat:1;
        /** ch1_enable_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch1_intstatus_enable1_reg_t;

/** Type of ch1_intstatus0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_block_tfr_done_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_block_tfr_done_intstat:1;
        /** ch1_dma_tfr_done_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch1_dma_tfr_done_intstat:1;
        uint32_t reserved_2:1;
        /** ch1_src_transcomp_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch1_src_transcomp_intstat:1;
        /** ch1_dst_transcomp_intstat : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_transcomp_intstat:1;
        /** ch1_src_dec_err_intstat : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch1_src_dec_err_intstat:1;
        /** ch1_dst_dec_err_intstat : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_dec_err_intstat:1;
        /** ch1_src_slv_err_intstat : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t ch1_src_slv_err_intstat:1;
        /** ch1_dst_slv_err_intstat : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch1_dst_slv_err_intstat:1;
        /** ch1_lli_rd_dec_err_intstat : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch1_lli_rd_dec_err_intstat:1;
        /** ch1_lli_wr_dec_err_intstat : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch1_lli_wr_dec_err_intstat:1;
        /** ch1_lli_rd_slv_err_intstat : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch1_lli_rd_slv_err_intstat:1;
        /** ch1_lli_wr_slv_err_intstat : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ch1_lli_wr_slv_err_intstat:1;
        /** ch1_shadowreg_or_lli_invalid_err_intstat : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ch1_shadowreg_or_lli_invalid_err_intstat:1;
        /** ch1_slvif_multiblktype_err_intstat : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_multiblktype_err_intstat:1;
        uint32_t reserved_15:1;
        /** ch1_slvif_dec_err_intstat : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_dec_err_intstat:1;
        /** ch1_slvif_wr2ro_err_intstat : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_wr2ro_err_intstat:1;
        /** ch1_slvif_rd2rwo_err_intstat : RO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_rd2rwo_err_intstat:1;
        /** ch1_slvif_wronchen_err_intstat : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_wronchen_err_intstat:1;
        /** ch1_slvif_shadowreg_wron_valid_err_intstat : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_shadowreg_wron_valid_err_intstat:1;
        /** ch1_slvif_wronhold_err_intstat : RO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_wronhold_err_intstat:1;
        uint32_t reserved_22:3;
        /** ch1_slvif_wrparity_err_intstat : RO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch1_slvif_wrparity_err_intstat:1;
        uint32_t reserved_26:1;
        /** ch1_ch_lock_cleared_intstat : RO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch1_ch_lock_cleared_intstat:1;
        /** ch1_ch_src_suspended_intstat : RO; bitpos: [28]; default: 0;
         *  NA
         */
        uint32_t ch1_ch_src_suspended_intstat:1;
        /** ch1_ch_suspended_intstat : RO; bitpos: [29]; default: 0;
         *  NA
         */
        uint32_t ch1_ch_suspended_intstat:1;
        /** ch1_ch_disabled_intstat : RO; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch1_ch_disabled_intstat:1;
        /** ch1_ch_aborted_intstat : RO; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch1_ch_aborted_intstat:1;
    };
    uint32_t val;
} dmac_ch1_intstatus0_reg_t;

/** Type of ch1_intstatus1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_ecc_prot_chmem_correrr_intstat:1;
        /** ch1_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch1_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch1_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch1_ecc_prot_uidmem_correrr_intstat:1;
        /** ch1_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch1_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch1_intstatus1_reg_t;

/** Type of ch1_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_enable_block_tfr_done_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_block_tfr_done_intsignal:1;
        /** ch1_enable_dma_tfr_done_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dma_tfr_done_intsignal:1;
        uint32_t reserved_2:1;
        /** ch1_enable_src_transcomp_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_transcomp_intsignal:1;
        /** ch1_enable_dst_transcomp_intsignal : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_transcomp_intsignal:1;
        /** ch1_enable_src_dec_err_intsignal : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_dec_err_intsignal:1;
        /** ch1_enable_dst_dec_err_intsignal : R/W; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_dec_err_intsignal:1;
        /** ch1_enable_src_slv_err_intsignal : R/W; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_src_slv_err_intsignal:1;
        /** ch1_enable_dst_slv_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_dst_slv_err_intsignal:1;
        /** ch1_enable_lli_rd_dec_err_intsignal : R/W; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_rd_dec_err_intsignal:1;
        /** ch1_enable_lli_wr_dec_err_intsignal : R/W; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_wr_dec_err_intsignal:1;
        /** ch1_enable_lli_rd_slv_err_intsignal : R/W; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_rd_slv_err_intsignal:1;
        /** ch1_enable_lli_wr_slv_err_intsignal : R/W; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_lli_wr_slv_err_intsignal:1;
        /** ch1_enable_shadowreg_or_lli_invalid_err_intsignal : R/W; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_shadowreg_or_lli_invalid_err_intsignal:1;
        /** ch1_enable_slvif_multiblktype_err_intsignal : R/W; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_multiblktype_err_intsignal:1;
        uint32_t reserved_15:1;
        /** ch1_enable_slvif_dec_err_intsignal : R/W; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_dec_err_intsignal:1;
        /** ch1_enable_slvif_wr2ro_err_intsignal : R/W; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wr2ro_err_intsignal:1;
        /** ch1_enable_slvif_rd2rwo_err_intsignal : R/W; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_rd2rwo_err_intsignal:1;
        /** ch1_enable_slvif_wronchen_err_intsignal : R/W; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wronchen_err_intsignal:1;
        /** ch1_enable_slvif_shadowreg_wron_valid_err_intsignal : R/W; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_shadowreg_wron_valid_err_intsignal:1;
        /** ch1_enable_slvif_wronhold_err_intsignal : R/W; bitpos: [21]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wronhold_err_intsignal:1;
        uint32_t reserved_22:3;
        /** ch1_enable_slvif_wrparity_err_intsignal : RO; bitpos: [25]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_slvif_wrparity_err_intsignal:1;
        uint32_t reserved_26:1;
        /** ch1_enable_ch_lock_cleared_intsignal : R/W; bitpos: [27]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_lock_cleared_intsignal:1;
        /** ch1_enable_ch_src_suspended_intsignal : R/W; bitpos: [28]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_src_suspended_intsignal:1;
        /** ch1_enable_ch_suspended_intsignal : R/W; bitpos: [29]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_suspended_intsignal:1;
        /** ch1_enable_ch_disabled_intsignal : R/W; bitpos: [30]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_disabled_intsignal:1;
        /** ch1_enable_ch_aborted_intsignal : R/W; bitpos: [31]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ch_aborted_intsignal:1;
    };
    uint32_t val;
} dmac_ch1_intsignal_enable0_reg_t;

/** Type of ch1_intsignal_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_enable_ecc_prot_chmem_correrr_intsignal : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_chmem_correrr_intsignal:1;
        /** ch1_enable_ecc_prot_chmem_uncorrerr_intsignal : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_chmem_uncorrerr_intsignal:1;
        /** ch1_enable_ecc_prot_uidmem_correrr_intsignal : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_uidmem_correrr_intsignal:1;
        /** ch1_enable_ecc_prot_uidmem_uncorrerr_intsignal : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch1_enable_ecc_prot_uidmem_uncorrerr_intsignal:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch1_intsignal_enable1_reg_t;

