espressif/esp-idf/components/soc/esp32p4/include/soc/gdma_struct.h
/** Type of ch2_intstatus_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_enable_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ecc_prot_chmem_correrr_intstat:1;
        /** ch2_enable_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch2_enable_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ecc_prot_uidmem_correrr_intstat:1;
        /** ch2_enable_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch2_intstatus_enable1_reg_t;

/** Type of ch2_intstatus0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_block_tfr_done_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch2_block_tfr_done_intstat:1;
        /** ch2_dma_tfr_done_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_dma_tfr_done_intstat:1;
        uint32_t reserved_2:1;
        /** ch2_src_transcomp_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch2_src_transcomp_intstat:1;
        /** ch2_dst_transcomp_intstat : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch2_dst_transcomp_intstat:1;
        /** ch2_src_dec_err_intstat : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch2_src_dec_err_intstat:1;
        /** ch2_dst_dec_err_intstat : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch2_dst_dec_err_intstat:1;
        /** ch2_src_slv_err_intstat : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t ch2_src_slv_err_intstat:1;
        /** ch2_dst_slv_err_intstat : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch2_dst_slv_err_intstat:1;
        /** ch2_lli_rd_dec_err_intstat : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch2_lli_rd_dec_err_intstat:1;
        /** ch2_lli_wr_dec_err_intstat : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch2_lli_wr_dec_err_intstat:1;
        /** ch2_lli_rd_slv_err_intstat : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch2_lli_rd_slv_err_intstat:1;
        /** ch2_lli_wr_slv_err_intstat : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ch2_lli_wr_slv_err_intstat:1;
        /** ch2_shadowreg_or_lli_invalid_err_intstat : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ch2_shadowreg_or_lli_invalid_err_intstat:1;
        /** ch2_slvif_multiblktype_err_intstat : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_multiblktype_err_intstat:1;
        uint32_t reserved_15:1;
        /** ch2_slvif_dec_err_intstat : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_dec_err_intstat:1;
        /** ch2_slvif_wr2ro_err_intstat : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_wr2ro_err_intstat:1;
        /** ch2_slvif_rd2rwo_err_intstat : RO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_rd2rwo_err_intstat:1;
        /** ch2_slvif_wronchen_err_intstat : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_wronchen_err_intstat:1;
        /** ch2_slvif_shadowreg_wron_valid_err_intstat : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_shadowreg_wron_valid_err_intstat:1;
        /** ch2_slvif_wronhold_err_intstat : RO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_wronhold_err_intstat:1;
        uint32_t reserved_22:3;
        /** ch2_slvif_wrparity_err_intstat : RO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch2_slvif_wrparity_err_intstat:1;
        uint32_t reserved_26:1;
        /** ch2_ch_lock_cleared_intstat : RO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch2_ch_lock_cleared_intstat:1;
        /** ch2_ch_src_suspended_intstat : RO; bitpos: [28]; default: 0;
         *  NA
         */
        uint32_t ch2_ch_src_suspended_intstat:1;
        /** ch2_ch_suspended_intstat : RO; bitpos: [29]; default: 0;
         *  NA
         */
        uint32_t ch2_ch_suspended_intstat:1;
        /** ch2_ch_disabled_intstat : RO; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch2_ch_disabled_intstat:1;
        /** ch2_ch_aborted_intstat : RO; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch2_ch_aborted_intstat:1;
    };
    uint32_t val;
} dmac_ch2_intstatus0_reg_t;

/** Type of ch2_intstatus1 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch2_ecc_prot_chmem_correrr_intstat:1;
        /** ch2_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch2_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch2_ecc_prot_uidmem_correrr_intstat:1;
        /** ch2_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch2_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch2_intstatus1_reg_t;

/** Type of ch2_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_enable_block_tfr_done_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_block_tfr_done_intsignal:1;
        /** ch2_enable_dma_tfr_done_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_dma_tfr_done_intsignal:1;
        uint32_t reserved_2:1;
        /** ch2_enable_src_transcomp_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_src_transcomp_intsignal:1;
        /** ch2_enable_dst_transcomp_intsignal : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_dst_transcomp_intsignal:1;
        /** ch2_enable_src_dec_err_intsignal : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_src_dec_err_intsignal:1;
        /** ch2_enable_dst_dec_err_intsignal : R/W; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_dst_dec_err_intsignal:1;
        /** ch2_enable_src_slv_err_intsignal : R/W; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_src_slv_err_intsignal:1;
        /** ch2_enable_dst_slv_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_dst_slv_err_intsignal:1;
        /** ch2_enable_lli_rd_dec_err_intsignal : R/W; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_lli_rd_dec_err_intsignal:1;
        /** ch2_enable_lli_wr_dec_err_intsignal : R/W; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_lli_wr_dec_err_intsignal:1;
        /** ch2_enable_lli_rd_slv_err_intsignal : R/W; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_lli_rd_slv_err_intsignal:1;
        /** ch2_enable_lli_wr_slv_err_intsignal : R/W; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_lli_wr_slv_err_intsignal:1;
        /** ch2_enable_shadowreg_or_lli_invalid_err_intsignal : R/W; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_shadowreg_or_lli_invalid_err_intsignal:1;
        /** ch2_enable_slvif_multiblktype_err_intsignal : R/W; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_multiblktype_err_intsignal:1;
        uint32_t reserved_15:1;
        /** ch2_enable_slvif_dec_err_intsignal : R/W; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_dec_err_intsignal:1;
        /** ch2_enable_slvif_wr2ro_err_intsignal : R/W; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_wr2ro_err_intsignal:1;
        /** ch2_enable_slvif_rd2rwo_err_intsignal : R/W; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_rd2rwo_err_intsignal:1;
        /** ch2_enable_slvif_wronchen_err_intsignal : R/W; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_wronchen_err_intsignal:1;
        /** ch2_enable_slvif_shadowreg_wron_valid_err_intsignal : R/W; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_shadowreg_wron_valid_err_intsignal:1;
        /** ch2_enable_slvif_wronhold_err_intsignal : R/W; bitpos: [21]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_wronhold_err_intsignal:1;
        uint32_t reserved_22:3;
        /** ch2_enable_slvif_wrparity_err_intsignal : RO; bitpos: [25]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_slvif_wrparity_err_intsignal:1;
        uint32_t reserved_26:1;
        /** ch2_enable_ch_lock_cleared_intsignal : R/W; bitpos: [27]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ch_lock_cleared_intsignal:1;
        /** ch2_enable_ch_src_suspended_intsignal : R/W; bitpos: [28]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ch_src_suspended_intsignal:1;
        /** ch2_enable_ch_suspended_intsignal : R/W; bitpos: [29]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ch_suspended_intsignal:1;
        /** ch2_enable_ch_disabled_intsignal : R/W; bitpos: [30]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ch_disabled_intsignal:1;
        /** ch2_enable_ch_aborted_intsignal : R/W; bitpos: [31]; default: 1;
         *  NA
         */
        uint32_t ch2_enable_ch_aborted_intsignal:1;
    };
    uint32_t val;
} dmac_ch2_intsignal_enable0_reg_t;

